{"sections":{"main":{"type":"rich-text","blocks":{"heading_4PQjxB":{"type":"heading","settings":{"heading":"{{ page.title }}","heading_size":"h1"}}},"block_order":["heading_4PQjxB"],"settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"scheme-2","full_width":true,"padding_top":100,"padding_bottom":100}},"rich_text_jnUmNx":{"type":"rich-text","blocks":{"text_HqUzeJ":{"type":"text","settings":{"text":"<p>Note: This Privacy Policy is designed to cover the collection, use, and disclosure of personal information by Sparkle Haven Jewellers. Please review and customize the content to tailor it to your store and business practices.]<\/p><p>Last updated: [Date]<\/p><p>This Privacy Policy describes how Sparkle Haven Jewellers (referred to as the \"Site\", \"we\", \"us\", or \"our\") collects, uses, and discloses personal information when you visit our website, use our services, or make purchases from sparkle-haven-jewellers.myshopify.com (referred to as the \"Site\") or communicate with us. By using any of our services, you agree to the collection, use, and disclosure of your information as described in this Privacy Policy. If you do not agree to this Privacy Policy, please do not use our services.<\/p><p>Changes to This Privacy Policy:<br\/>We may update this Privacy Policy from time to time to reflect changes in our practices or for other reasons. We will post the revised Privacy Policy on the Site and update the \"Last updated\" date accordingly.<\/p><p>How We Collect and Use Your Personal Information:<br\/>To provide our services, we collect and have collected personal information about you from various sources. The information we collect and use depends on how you interact with us.<\/p><p>Information We Collect Directly from You:<\/p><ul><li>Basic contact details: name, address, phone number, email<\/li><li>Order information: billing address, shipping address, payment confirmation, email address, phone number<\/li><li>Account information: username, password, security questions<\/li><li>Shopping information: items viewed, added to cart, or wishlist<\/li><li>Customer support information: communications with us<\/li><\/ul><p>Information We Collect through Cookies:<br\/>We automatically collect certain information about your interaction with our Site using cookies and similar technologies. This may include device information, browser information, network connection information, IP address, and usage data.<\/p><p>Information We Obtain from Third Parties:<br\/>We may obtain information about you from third parties, including vendors, service providers, and partners. This information may include payment information, browsing activity, and other relevant data.<\/p><p>How We Use Your Personal Information:<br\/>We use your personal information to provide our services, including processing payments, fulfilling orders, and providing customer support. We also use your information for marketing and advertising purposes, security and fraud prevention, and to improve our services.<\/p><p>Cookies:<br\/>We use cookies to improve the functionality of our Site and better understand user interaction. You can choose to remove or reject cookies through your browser settings, but this may affect your user experience.<\/p><p>How We Disclose Personal Information:<br\/>We may disclose your personal information to third parties for legitimate purposes, including vendors, business partners, affiliates, and in connection with business transactions or legal obligations.<\/p><p>User Generated Content:<br\/>If you post user-generated content on our Site, it will be publicly accessible. We are not responsible for the privacy or security of such information.<\/p><p>Third Party Websites and Links:<br\/>We may provide links to third-party websites. We are not responsible for the privacy or security of these sites.<\/p><p>Children's Data:<br\/>Our services are not intended for children under 16 years of age, and we do not knowingly collect personal information from them.<\/p><p>Security and Retention of Your Information:<br\/>We implement security measures to protect your information but cannot guarantee perfect security. We retain your information as needed for business purposes and legal obligations.<\/p><p>Your Rights and Choices:<br\/>Depending on your location, you may have certain rights regarding your personal information, including the right to access, delete, correct, or restrict its use.<\/p><p>Complaints:<br\/>If you have complaints about how we process your personal information, please contact us. You may also have the right to appeal our decision or lodge a complaint with your local data protection authority.<\/p><p>International Users:<br\/>Your personal information may be transferred, stored, and processed outside of your country, including in the United States. We use recognized transfer mechanisms for data transfers out of Europe.<\/p><p>Contact:<br\/>If you have any questions about our privacy practices or this Privacy Policy, please contact us at [contact information].<\/p><p>[Note: If your site is governed by GDPR, include relevant disclosures and contact details for your representative in the EEA and the UK.]<\/p>"}}},"block_order":["text_HqUzeJ"],"settings":{"desktop_content_position":"center","content_alignment":"left","color_scheme":"","full_width":true,"padding_top":60,"padding_bottom":60}}},"order":["main","rich_text_jnUmNx"]}